test-harness/display/data/httperf/Patricks-MacBook-Pro.local-2016.07.07T09.05.59.log
start-time 2016-07-06T18:01:56
httperf --verbose --timeout=5 --client=0/1 --server=apache --port=80 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 1048576
reply-rate = 100.0   
reply-rate = 97.8    
Maximum connect burst length: 1

Total: connections 1000 requests 989 replies 989 test-duration 14.990 s

Connection rate: 66.7 conn/s (15.0 ms/conn, <=8 concurrent connections)
Connection time [ms]: min 0.2 avg 0.2 max 0.7 median 0.5 stddev 0.1
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 66.0 req/s (15.2 ms/req)
Request size [B]: 59.0

Reply rate [replies/s]: min 97.8 avg 98.9 max 100.0 stddev 1.6 (2 samples)
Reply time [ms]: response 0.2 transfer 0.0
Reply size [B]: header 228.0 content 44.0 footer 0.0 (total 272.0)
Reply status: 1xx=0 2xx=989 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.87 system 8.92 (user 39.2% system 59.5% total 98.7%)
Net I/O: 21.3 KB/s (0.2*10^6 bps)

Errors: total 11 client-timo 8 socket-timo 0 connrefused 3 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0