test-harness/display/data/httperf/Patricks-MacBook-Pro.local-2016.07.07T09.44.59.log
start-time 2016-07-07T13:34:46
test-duration 120
httperf --verbose --timeout=5 --client=0/1 --server=apache --port=80 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --num-conns=12000 --num-calls=1
httperf: maximum number of open descriptors = 1048576
reply-rate = 100.0   
reply-rate = 100.0   
reply-rate = 100.0   
[...]
reply-rate = 61.2    
reply-rate = 136.2   
reply-rate = 43.6    
reply-rate = 144.0   
reply-rate = 110.6   
reply-rate = 49.4    
reply-rate = 150.2   
reply-rate = 11.8    
reply-rate = 0.0     
reply-rate = 0.0     
reply-rate = 0.0     
[...]
Maximum connect burst length: 2

Total: connections 12000 requests 5777 replies 5535 test-duration 124.990 s

Connection rate: 96.0 conn/s (10.4 ms/conn, <=503 concurrent connections)
Connection time [ms]: min 0.2 avg 560.0 max 3217.1 median 0.5 stddev 958.9
Connection time [ms]: connect 267.1
Connection length [replies/conn]: 1.000

Request rate: 46.2 req/s (21.6 ms/req)
Request size [B]: 59.0

Reply rate [replies/s]: min 0.0 avg 46.1 max 150.2 stddev 55.7 (24 samples)
Reply time [ms]: response 298.5 transfer 0.0
Reply size [B]: header 228.0 content 44.0 footer 0.0 (total 272.0)
Reply status: 1xx=0 2xx=5535 3xx=0 4xx=0 5xx=0

CPU time [s]: user 65.31 system 57.87 (user 52.3% system 46.3% total 98.6%)
Net I/O: 14.4 KB/s (0.1*10^6 bps)

Errors: total 6465 client-timo 6459 socket-timo 0 connrefused 6 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0