test-harness/display/data/httperf/Patricks-MacBook-Pro.local-2016.07.08T09.35.55.log
start-time 2016-07-08T13:20:48
test-duration 10
httperf --verbose --timeout=5 --client=0/1 --server=apache --port=80 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 1048576
reply-rate = 0.0     
reply-rate = 0.0     
reply-rate = 0.0     
Maximum connect burst length: 2

Total: connections 1000 requests 167 replies 6 test-duration 16.625 s

Connection rate: 60.2 conn/s (16.6 ms/conn, <=503 concurrent connections)
Connection time [ms]: min 5820.5 avg 6603.6 max 7814.7 median 6552.5 stddev 744.4
Connection time [ms]: connect 120.2
Connection length [replies/conn]: 1.000

Request rate: 10.0 req/s (99.5 ms/req)
Request size [B]: 59.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (3 samples)
Reply time [ms]: response 3933.0 transfer 0.0
Reply size [B]: header 228.0 content 44.0 footer 0.0 (total 272.0)
Reply status: 1xx=0 2xx=6 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.32 system 3.95 (user 26.0% system 23.8% total 49.7%)
Net I/O: 0.7 KB/s (0.0*10^6 bps)

Errors: total 994 client-timo 803 socket-timo 0 connrefused 191 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0