test-harness/display/data/httperf/Patricks-MacBook-Pro.local-2016.07.08T10.20.51.log
start-time 2016-07-08T14:18:10
test-duration 10
httperf --verbose --timeout=5 --client=0/1 --server=apache --port=80 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
httperf: maximum number of open descriptors = 1048576
reply-rate = 0.0     
reply-rate = 0.0     
reply-rate = 0.6     
Maximum connect burst length: 4

Total: connections 1000 requests 170 replies 9 test-duration 15.392 s

Connection rate: 65.0 conn/s (15.4 ms/conn, <=504 concurrent connections)
Connection time [ms]: min 5142.2 avg 5998.3 max 7481.4 median 5631.5 stddev 786.0
Connection time [ms]: connect 145.4
Connection length [replies/conn]: 1.000

Request rate: 11.0 req/s (90.5 ms/req)
Request size [B]: 59.0

Reply rate [replies/s]: min 0.0 avg 0.2 max 0.6 stddev 0.3 (3 samples)
Reply time [ms]: response 3219.0 transfer 0.0
Reply size [B]: header 228.0 content 44.0 footer 0.0 (total 272.0)
Reply status: 1xx=0 2xx=9 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.00 system 3.64 (user 26.0% system 23.6% total 49.6%)
Net I/O: 0.8 KB/s (0.0*10^6 bps)

Errors: total 991 client-timo 817 socket-timo 0 connrefused 174 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0