test-harness/display/data/httperf/Patricks-MacBook-Pro.local-2016.07.08T16.50.27.log
start-time 2016-07-08T18:57:57
test-duration 20
httperf --verbose --timeout=5 --client=0/1 --server=apache --port=80 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --num-conns=2000 --num-calls=1
httperf: maximum number of open descriptors = 1048576
reply-rate = 0.0     
reply-rate = 0.0     
reply-rate = 0.0     
reply-rate = 8.4     
reply-rate = 19.8    
Maximum connect burst length: 3

Total: connections 2000 requests 494 replies 194 test-duration 26.835 s

Connection rate: 74.5 conn/s (13.4 ms/conn, <=554 concurrent connections)
Connection time [ms]: min 2905.6 avg 5741.0 max 8001.6 median 5601.5 stddev 1751.1
Connection time [ms]: connect 742.8
Connection length [replies/conn]: 1.000

Request rate: 18.4 req/s (54.3 ms/req)
Request size [B]: 59.0

Reply rate [replies/s]: min 0.0 avg 5.6 max 19.8 stddev 8.7 (5 samples)
Reply time [ms]: response 4183.6 transfer 0.0
Reply size [B]: header 228.0 content 44.0 footer 0.0 (total 272.0)
Reply status: 1xx=0 2xx=194 3xx=0 4xx=0 5xx=0

CPU time [s]: user 7.19 system 6.17 (user 26.8% system 23.0% total 49.8%)
Net I/O: 3.0 KB/s (0.0*10^6 bps)

Errors: total 1806 client-timo 1624 socket-timo 0 connrefused 182 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0